app/controllers/reforms_controller.rb

SELECT "reforms".* FROM "reforms"
---
  def index
    @reforms = Reform.all

INSERT INTO "reforms" ("client", "description", "closed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["client", "asdf"], ["description", "teste"], ["closed", "f"], ["created_at", "2016-01-22 03:23:50.297322"], ["updated_at", "2016-01-22 03:23:50.297322"]]
---
  def create
    @reform = Reform.new(reform_params)
    if @reform.save

SELECT  "reforms".* FROM "reforms" WHERE "reforms"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "reforms" SET "closed" = ?, "updated_at" = ? WHERE "reforms"."id" = ?  [["closed", "t"], ["updated_at", "2016-01-22 03:13:57.463729"], ["id", 1]]
---
  def close
    if Reform.exists?(params[:close])
      @reform = Reform.find(params[:close])
      @reform.closed=1
      @reform.save